[
  {
    "imagePath": "resources/img/projects/insomnia.png",
    "videoUrl": "https://player.vimeo.com/video/258247916?title=0&byline=0&portrait=0",
    "title": "Insomnia dj set",
    "shortDescription": "Live performance in secret spot",
    "description": "Live, audioreactive visuals and Insomnia's dj set. This is a teaser of the full performance.",
    "readMoreDescription": "Sorry - this is only temporary video upload provider... Will be changed soon."
  },

  {
    "imagePath": "resources/img/projects/cybul.png",
    "videoUrl": "https://player.vimeo.com/video/258172422?title=0&byline=0&portrait=0",
    "title": "Cybulski: interactive",
    "shortDescription": "An interactive multimedia installation",
    "description": "",
    "readMoreDescription": ""
  },

  {
    "imagePath": "resources/img/projects/faultyNature.png",
    "videoUrl": "https://player.vimeo.com/video/244810327?title=0&byline=0",
    "title": "The Faulty Nature",
    "shortDescription": "An abstract story from cell to human",
    "description": "An audiovisual live performance combining electronic music and live guitar with audioreactive visuals. The visuals consists of pre-prepared videos, geometric structures and glitches generated with custom software in real time. To create the glitches, we used digital audio processing algorithms adapted to work on a video.",
    "readMoreDescription": "Error A​‌B​‌C​‌Ć​‌Č​‌D​‌Đ​‌E​‌F​‌G​‌H​‌I​‌J​‌K​‌L​‌M​‌N​‌O​‌P​‌Q​‌R​‌S​‌Š​‌T​‌U​‌V​‌W​‌X​‌Y​‌Z​‌Ž​‌a​‌b​‌c​‌č​‌ć​‌d​‌đ​‌e​‌f​‌g​‌h​‌i​‌j​‌k​‌l​‌m​‌n​‌o​‌p​‌q​‌r​‌s​‌š​‌t​‌u​‌v​‌w​‌x​‌y​‌z​‌ž​‌Ă​‌Â​‌Ê​‌Ô​‌Ơ​‌Ư​‌ă​‌â​‌ê​‌ô​‌ơ​‌ư​‌1​‌2​‌3​‌4​‌5​‌6​‌7​‌8​‌9​‌0(​‌%​‌)​‌[​‌#​‌]​‌{​‌@​‌}​‌/​‌&​‌‌-​‌+​‌÷​‌×​‌=‌®​‌©​‌$​‌€​‌£​‌¥​‌¢​‌:​‌;​‌,​‌.​‌*"
  },

  {
    "imagePath": "resources/img/projects/dyplom_1.png",
    "videoUrl": "https://player.vimeo.com/video/218154097?title=0&byline=0&portrait=0",
    "title": "Kaspar_Hauser_libretto",
    "shortDescription": "An interactive multimedia installation.",
    "description": "What are the feelings of a person entering a new, unknown reality whose rule is only empirically known, having only knowledge acquired in the world known to him? Each of us experienced this situation shortly after birth, but it was impossible to retain that experience. Imagine, however, that by disposing of the knowledge we have acquired &quotwe are entering the world&quot once again. This world, seemingly similar to the previous one, is governed by other rules that initially remain a mystery. Meanwhile, the new Universum is not something completely alien - we still have five senses, so in the same way as the previous world, we can know this undiscovered.<br/><br/>",
    "readMoreDescription": "Inspired by the history of Kaspar Hauser, we have started to create an interactive multimedia installation that could enable us to enter the novum in the created space. In order to create the opportunity to generate new visual stimuli, we set out to build an environment for a potential viewer - contemporary Kaspar. This is the result of a widescreen installation: three interlocking screens that show the images they narrate and the way reality is presented give the opportunity to move to an environment in which the rules of perceiving events break down, cut the time to such an extent that it destroys the known recipient periodicity. Libretto is meant to develop a nonstandard perception of what the viewer is perceiving. New rules, unusual perspective, but still tangentially familiar - this time is shown in a different way, so that the sensibility of belonging to the new world is increasing and encouraging exploration. With the use of RGB glasses and Kinect as a tracking device, giving the audience the chance to interact, we want to get the impression of being in a new environment, as well as the opportunity to influence events that without the audience lose their chronology. We put the viewer in a non-standard situation and leave him alone with a multitude of experienced stimuli. We want to realize a different direction of perception, a non-traditional way of thinking about space, to break away from what is known - to provoke in the exploring desire to discover, as a result of the curious character of the world, which in the era of universal digitization somewhere lost.<br/><br/> Installation consist of three projection canvas and Microsoft Kinect sensor. The objective was to explore the way we perceive perspective, and to use our body as an interface instead of mouse or keyboard. It was necessary to write software to enable interactions. The software was created using Java and Processing. To discover fully this artwork, it requires to be watched through special three - color lenses. Playing around with red, blue and green channels in video we've achieved new way how to observe things. We can divide it on three basic parts: <br/><br/> <b>Intro</b> - interactive intro which starts video sequence, beginning from part one.<br/> <b>Part one &quotNature&quot</b> - three different experimental video expressions about nature.<br/> <b>Part two &quotHuman&quot</b> - three different experimental video expressions about human.<br/>"
  },

  {
    "imagePath": "resources/img/projects/holo.png",
    "videoUrl": "https://player.vimeo.com/video/192857023?title=0&byline=0&portrait=0",
    "title": "Brand_New_Music _Audioreactive_hologram",
    "shortDescription": "A live hologram installation.",
    "description": "The double bass player playing the instrument in real time affects the image of himself generated by the Kinect sensor and displayed as a hologram. Using the Processing and Kinect Sensor we've created, software which processes information about music and interprets it as a variable of the image viewed as hologram. In other words - this what he plays affects  the image of him, viewed in real time as a hologram for the people sitting in the audience. The whole system contained the ability to play live holograms, turning it into something like a holographic visualization of a live concert. The concert lasted 45 minutes and was designed and performed as part of the Brand New Music Festival organized by the Academy of Music in Katowice in 21st of November 2016.",
    "readMoreDescription": ""
  },

  {
    "imagePath": "resources/img/projects/heaven_2.png",
    "videoUrl": "https://www.youtube.com/embed/hjWgMS5s6MQ",
    "title": "Heaven",
    "shortDescription": "Experimental video-art, animation.",
    "description": "Living in a world where we strive for perfect image quality we decided to break this trend and antagonistically we have created a graphic value based on an analog error. The hero of the animation of HEAVEN is specifically involved in the reality in which he exits, with every move or gesture he tries to get out of it, but at the same time he is pulled back into it by merging into one pixel magma.<br/><br/> We have taken the challenge of creating an experimental vision of the world in which all of us can be mentally involved - the virtual world of interpersonal relationships, the world from which there is no way out.<br/><br/>Awarded at 2nd FFN cineRAMAfest, Gdynia 2017.",
    "readMoreDescription": ""
  },

  {
    "imagePath": "resources/img/projects/insound.png",
    "videoUrl": "https://www.youtube.com/embed/1xcX798Ak50",
    "title": "Insound",
    "shortDescription": "Experimental video-art, animation.",
    "description": "Experimental animation  shows us a dreamy vision of journey to the inside of the sound.<br/><br/>2nd award at KLAPS festival, 2015.",
    "readMoreDescription": ""
  },

  {
    "imagePath": "resources/img/projects/krolik.png",
    "videoUrl": "https://player.vimeo.com/video/171574690?title=0&byline=0&portrait=0",
    "title": "Alice_in_Wonderland_rabbit",
    "shortDescription": "An interactive animation.",
    "description": "",
    "readMoreDescription": ""
  }

]
